#!/usr/bin/python

# -*- coding=utf-8 -*-

# -------------------------------------------------------------------------------

# Name:        disambig_const.py
# Purpose:     Arabic lexical analyser constants used for disambiguation before analysis
#
# Author:      Taha Zerrouki (taha.zerrouki[at]gmail.com)
#
# Created:     31-10-2011
# Copyright:   (c) Taha Zerrouki 2011
# Licence:     GPL
# -------------------------------------------------------------------------------
"""
Constants for Disambiguation Module
"""
# import  pyarabic.araby as araby
DISAMBIGUATATION_TABLE = {
    # إذا كانت الكلمة الحالية "أن" تكون "أنْ" حرف نصب إذا سبقت فعلا
    # وتكون أنّ، من أخوات إنّ إذا كان ما بعدها اسما
    "أن": {
        "verb": {"tag": "t", "vocalized": "أَنْ"},
        "noun": {"tag": "t", "vocalized": "أَنَّ"},
        "previous": {
            # أنّ
            "غير": "أَنَّ",
            "لو": "أَنَّ",
            "لولا": "أَنَّ",
            "بما": "أَنَّ",
            "ربما": "أَنَّ",
            "لعل": "أَنَّ",
            "ليت": "أَنَّ",
            "إلا": "أَنَّ",
            "أم": "أَنَّ",
            "كما": "أَنَّ",
            "رغم": "أَنَّ",
            "بيد": "أَنَّ",
            "حتى": "أَنَّ",
            "بحجة": "أَنَّ",
            "ثم": "أَنَّ",
            "يعني": "أَنَّ",
            #                   u'من': u'أَنَّ',
            "في": "أَنَّ",
            #                   u'إلى': u'أَنَّ',
            # أنْ
            "هو": "أَنْ",
            "هي": "أَنْ",
            "إما": "أَنْ",
            "أو": "أَنْ",
            # ~ u'على':u'أَنْ',
            "بلا": "أَنْ",
            "قبل": "أَنْ",
            "بعد": "أَنْ",
            "منذ": "أَنْ",
            "يجب": "أَنْ",
            "ينبغي": "أَنْ",
            "يمكن": "أَنْ",
            "يكاد": "أَنْ",
            "تكاد": "أَنْ",
            "كاد": "أَنْ",
            "عسى": "أَنْ",
            "يريد": "أَنْ",
            "تريد": "أَنْ",
            "أريد": "أَنْ",
            "أراد": "أَنْ",
            "أرادت": "أَنْ",
            "أوشك": "أَنْ",
            "أوشكت": "أَنْ",
        },
    },
    "إن": {
        "verb": {"tag": "t", "vocalized": "إِنْ"},
        "noun": {"tag": "t", "vocalized": "إِنَّ"},
        "previous": {
            # أنّ
            "والله": "إِنَّ",
            "ألا": "إِنَّ",
            "أما": "إِنَّ",
            "كلا": "إِنَّ",
            "حتى": "إِنَّ",
            # أنْ
            #   u'هو':u'إِنْ',
        },
    },
    # إذا كانت الكلمة الحالية "من" تكون "مَنْ" حرف استفهام  إذا سبقت فعلا
    # وتبقى ملتبسة إذا سبقت اسما.
    "من": {
        "verb": {"tag": "t", "vocalized": "مَنْ"},
        "noun": {"tag": "t", "vocalized": "ْمِن"},
    },
    # u'ثنا':{'abbr':u'ثَنَا',}
}
